gui_start
analyze -library WORK -format vhdl {/home/ms20.25/cap3/syn/3-1-2/constants.vhd}
analyze -library WORK -format vhdl {/home/ms20.25/cap3/syn/3-1-2/registerfile.vhd}
elaborate REGISTER_FILE -architecture A -library DEFAULT -parameters "NBIT = 32, NADDRESS = 5, NADDRESS = 5"
compile -exact_map
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
uplevel #0 { report_power -analysis_effort low }
create_clock -name "CLK" -period 2 CLK
compile
uplevel #0 { report_power -analysis_effort low }
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
set_max_delay 2 -from [all_inputs] -to [all_outputs]
compile
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
uplevel #0 { report_power -analysis_effort low }
write -hierarchy -format vhdl -output /home/ms20.25/cap3/syn/3-1-2/post_syn_optimized.vhdl
