gui_start
analyze -library WORK -format vhdl {/home/ms20.25/cap2/syn/2-2-2/rca.vhd /home/ms20.25/cap2/syn/2-2-2/mux81_generic.vhd /home/ms20.25/cap2/syn/2-2-2/encoder.vhd /home/ms20.25/cap2/syn/2-2-2/constants.vhd /home/ms20.25/cap2/syn/2-2-2/complement.vhd /home/ms20.25/cap2/syn/2-2-2/booth_encoder.vhd /home/ms20.25/cap2/syn/2-2-2/BOOTHMUL.vhd}
elaborate BOOTHMUL -architecture STRUCTURAL -library DEFAULT -parameters "NBIT = 8"
compile -exact_map
write -hierarchy -format vhdl -output /home/ms20.25/cap2/syn/2-2-2/netlist_mul_post_syn.vhdl
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
uplevel #0 { report_timing -path full -delay max -nworst 10 -max_paths 1 -significant_digits 2 -sort_by group }
set_max_delay 1.8 -from [all_inputs] -to [all_outputs]
compile -map_effort high
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
elaborate BOOTHMUL -architecture STRUCTURAL -library DEFAULT -parameters "NBIT = 32"
compile -exact_map
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
uplevel #0 { report_area -nosplit }
set_max_delay 6.6 -from [all_inputs] -to [all_outputs]
compile -map_effort high
uplevel #0 { report_timing -path full -delay max -nworst 1 -max_paths 1 -significant_digits 2 -sort_by group }
uplevel #0 { report_area -nosplit }
